
-- ====================== 文件信息 ======================

-- 剑侠情缘online IB 版本限制托管的头文件
-- Edited by peres
-- 2006/10/30 PM 15:42

-- 烟花。那一夜的烟花。
-- 她记得他在大雨的人群中，站在她的背后拥抱住她。
-- 他温暖的皮肤，他熟悉的味道。烟花照亮她的眼睛。
-- 一切无可挽回……

-- ======================================================

NUM_OFFLINE_PERMITREGION_MAX = 10;  -- 离不允许托管点的最小半径

aryLimitRegion = {
	--Biện Kinh
	[37]={
		{1630, 3187},--NPC Xa Phu	
		{1704, 3224},--NPC Xa Phu	
		{1595, 2994},--NPC Xa Phu	
		{1860, 2928},--NPC Xa Phu	
		{1755, 3043},--Võ Lâm Truyền nhân	
		{1806, 3098},--Lễ Quan	
		{1712, 3102},--Thợ rèn	
		{1747, 3050},--Thợ rèn	
		{1773, 3090},--Dược Điếm	
		{1786, 3103},--Tiệm Tạp Hóa	
		{1776, 3063},--Sứ Giả Kiệt Xuất	
		{1740, 3065},--Thí Luyện Đường	
		{1646, 3050},--Nhiếp Thí Trần	
		{1589, 3096},--Hàng Rong	
		{1784, 3042},--Nội Các Thượng Thư	
		{1641, 3145},--Bình Bình Cô Nương	
		{16620, 3019},--Bình Bình Cô Nương	
		{1713, 374},--Bình Bình Cô Nương	
		{1865, 2968},--Bình Bình Cô Nương	
		{1734, 3102},--Dã Tẩu	
		{1693, 3212},--Xa Phu Công Thành	
	},

	--Đại Lý
	[162]={
		{1669, 3124},--NPC Xa Phu	
		{1697, 3279},--NPC Xa Phu	
		{1469, 3269},--NPC Xa Phu	
		{1628, 3184},--Võ Lâm Truyền nhân	
		{1587, 3221},--Lễ Quan	
		{15599, 3262},--Thợ rèn	
		{1449, 3211},--Dược Điếm	
		{1535, 3201},--Tiệm Tạp Hóa	
		{1651, 3226},--Sứ Giả Liên Đấu	
		{1613, 3190},--Thí Luyện Đường	
		{1574, 3227},--Nhiếp Thí Trần	
		{1671, 3236},--Hàng Rong	
		{1651, 3226},--Dã Tẩu	
		{1681, 3276},--Xa Phu Công Thành	
	},

	--Tương Dương
	[78] = {
		{1509, 3140},--NPC Xa Phu	
		{1439, 3212},--NPC Xa Phu	
		{1598, 3378},--NPC Xa Phu	
		{1693, 3233},--NPC Xa Phu	
		{1609, 3259},--Võ Lâm Truyền nhân	
		{1541, 3247},--Lễ Quan	
		{1550, 3217},--Thợ rèn	
		{1612, 3244},--Dược Điếm	
		{1628, 3262},--Tiệm Tạp Hóa	
		{1546, 3118},--Sứ Giả Kiệt Xuất	
		{1606, 3238},--Thí Luyện Đường	
		{1511, 3208},--Nhiếp Thí Trần	
		{1489, 3270},--Hàng Rong	
		{1594, 3289},--Dã Tẩu	
		{1582, 3379},--Xa Phu Công Thành	
		{1554, 3183},--Thần Bí thương nhân			
	},

	--Thành Đô
	[11]={
		{3196, 5194},--NPC Xa Phu	
		{3266, 5003},--NPC Xa Phu	
		{3027, 4960},--NPC Xa Phu	
		{3017, 5090},--NPC Xa Phu	
		{3135, 5045},--Võ Lâm Truyền nhân	
		{3126, 4994},--Lễ Quan	
		{3104, 5121},--Thợ rèn	
		{3141, 5136},--Dược Điếm	
		{3095, 5136},--Tiệm Tạp Hóa	
		{3213, 5148},--Sứ Giả Liên đấu	
		{3109, 5059},--Thí Luyện Đường	
		{3210, 4974},--Nhiếp Thí Trần	
		{3180, 4947},--Hàng Rong	
		{3153, 5066},--Dã Tẩu	
		{3185, 5182},--Xa Phu Công Thành	
	},
	
	--Dương Châu
	[80]={
		{1717, 3198},--NPC Xa Phu	
		{1592, 3195},--NPC Xa Phu	
		{1670, 2991},--NPC Xa Phu	
		{1825, 3064},--NPC Xa Phu	
		{1792, 3047},--Võ Lâm Truyền nhân	
		{1745, 3000},--Lễ Quan	
		{1689, 3170},--Thợ rèn	
		{1773, 3079},--Dược Điếm	
		{1701, 3022},--Tiệm Tạp Hóa	
		{1754, 3035},--Sứ Giả Liên đấu	
		{1705, 3058},--Thí Luyện Đường	
		{1702, 2962},--Nhiếp Thí Trần	
		{1638, 3049},--Hàng Rong	
		{1743, 2966},--Dã Tẩu	
		{1691, 3219},--Xa Phu Công Thành	
	},
	
	--Phượng Tường
	[1]={
		{1647, 3166},--NPC Xa Phu	
		{1557, 3108},--NPC Xa Phu	
		{1520, 3230},--NPC Xa Phu	
		{1652, 3281},--NPC Xa Phu	
		{1623, 3205},--Võ Lâm Truyền nhân	
		{1614, 3152},--Lễ Quan	
		{1618, 3196},--Thợ rèn	
		{1604, 3190},--Dược Điếm	
		{1559, 3206},--Tiệm Tạp Hóa	
		{1671, 3218},--Sứ Giả Liên đấu	
		{1586, 3229},--Thí Luyện Đường	
		{1507, 3198},--Nhiếp Thí Trần	
		{1619, 3103},--Hàng Rong	
		{1618, 3090},--Dã Tẩu	
		{1640, 3270},--Xa Phu Công Thành	
	},
	
	--Lâm An
	[176]={
		{1606, 3292},--NPC Xa Phu	
		{1372, 3329},--NPC Xa Phu	
		{1601, 2912},--NPC Xa Phu	
		{1353, 3014},--NPC Xa Phu	
		{1532, 3010},--Võ Lâm Truyền nhân	
		{1506, 2984},--Lễ Quan	
		{1683, 3220},--Thợ rèn	
		{1332, 3060},--Thợ rèn	
		{1520, 2986},--Thợ rèn	
		{1685, 3319},--Dược Điếm	
		{1474, 3362},--Dược Điếm	
		{1544, 2964},--Dược Điếm	
		{1615, 2977},--Dược Điếm	
		{1340, 3165},--Tiệm Tạp Hóa	
		{1457, 3259},--Sứ Giả Kiệt Xuất	
		{1592, 2944},--Thí Luyện Đường	
		{1371, 3007},--Nhiếp Thí Trần	
		{1387, 2961},--Hàng Rong	
		{1561, 2980},--Dã Tẩu	
		{1689, 3291},--Xa Phu Công Thành	
		{1654, 3263},--Chưởng Đằng Cung Nữ	
		{1439, 3268},--Chưởng Đằng Cung Nữ	
		{1384, 2979},--Chưởng Đằng Cung Nữ	
		{1576, 2958},--Chưởng Đằng Cung Nữ	
		{1314, 3195},--Thợ rèn Thấn bí	
		{1412, 3312},--Võ Lâm Minh Chủ	
		{1442, 3061},--Chủ Tiền Trang	
		{1478, 3237},--Nội Các Thượng Thư	
		{1312, 2848},--Thấn Bí Thương Nhân	
		{1657, 3261},--Chưởng Đăng Cung Nữ
		{1577, 2957},--Chưởng Đăng Cung Nữ
		{1439, 3267},--Chưởng Đăng Cung Nữ
		{1385, 2977},--Chưởng Đăng Cung Nữ
	},
	
	--Ba Lăng Huyện
	[53]={
		{1626, 3172},--Dã Tẩu	
		{1629, 3195},--Lễ Quan	
		{1598, 3209},--Hiệu Thuốc	
		{1600, 3170},--Tạp Hóa	
		{1578, 3236},--Xa Phu	
	},
	
	--Giang Tân Thôn
	[20]={
		{3538, 6231},--Dã Tẩu	
		{3552, 6192},--Lễ Quan	
		{3469, 6164},--Hiệu Thuốc	
		{3370, 6256},--Tạp Hóa	
		{3458, 6110},--Xa Phu	
		{3522, 6117},--Nguyệt Lão	
	},
	
	--Vĩnh Lạc
	[99]={
		{1646, 3192},--Dã Tẩu	
		{1614, 3177},--Lễ Quan	
		{1595, 3227},--Hiệu Thuốc	
		{1606, 3282},--Tạp Hóa	
		{1630, 3304},--Xa Phu	
		{1607, 3161},--	
	},
	
	--Chu Tiên Trấn
	[100]={
		{1616, 3199},--Dã Tẩu	
		{1621, 3181},--Lễ Quan	
		{1657, 3124},--Hiệu Thuốc	
		{1641, 3126},--Tạp Hóa	
		{1610, 3097},--Xa Phu	
		{1678, 3101},--Xa Phu	
		{1719, 3217},--Xa Phu	
		{1603, 3168},--Xa Phu	
	},
	
	--Đạo Hương Thôn
	[101]={
		{1677, 3143},--Dã Tẩu	
		{1671, 3172},--Lễ Quan	
		{1679, 3196},--Hiệu Thuốc	
		{1639, 3144},--Tạp Hóa	
		{1623, 3098},--Xa Phu	
	},
	
	--Long Môn Trấn
	[121]={
		{1959, 4500},--Dã Tẩu	
		{1958, 4517},--Lễ Quan	
		{1934, 4551},--Hiệu Thuốc	
		{1914, 4524},--Tạp Hóa	
		{1924, 4527},--Xa Phu	
		{1980, 4593},--Xa Phu
	},
	
	--Thạch Cổ Trấn
	[123]={
		{1643, 3235},--Dã Tẩu	
		{1606, 3227},--Lễ Quan	
		{1600, 3209},--Hiệu Thuốc	
		{1630, 3231},--Tạp Hóa	
		{1658, 3244},--Xa Phu	
	},
	
	--Long Tuyền Thôn
	[174]={
		{1608, 3200},--Dã Tẩu	
		{1631, 3215},--Lễ Quan	
		{1572, 3253},--Hiệu Thuốc	
		{1566, 3202},--Tạp Hóa	
		{1634, 3196},--Xa Phu	
	},
--	-- 临安
--	[176]={
--		{1695, 3294},
--		{1373, 3333},
--		{1353, 3018},
--		{1602, 2912},
--		{1687, 3319},
--		{1476, 3363},
--		{1545, 2966},
--		{1615, 2976},
--		{1340, 3166},
--		{1505, 2982},
--	},
--
--	-- 汴京
--	[37]={
--		{1704, 3222},
--		{1632, 3185},
--		{1595, 2995},
--		{1862, 2927},
--		{1785, 3104},
--		{1773, 3091},
--		{1806, 3097},
--	},
--
--	-- 成都
--	[11]={
--		{3196, 5193},
--		{3018, 5089},
--		{3029, 4958},
--		{3261, 5004},
--		{3095, 5135},
--		{3141, 5134},
--		{3126, 4993},
--	},
--
--	-- 大理
--	[162]={
--		{1667, 3126},
--		{1468, 3271},
--		{1697, 3277},
--		{1535, 3202},
--		{1500, 3213},
--		{1586, 3221}
--	},
--	
--	-- 襄阳
--	[78]={
--		{1596, 3379},
--		{1439, 3214},
--		{1511, 3142},
--		{1689, 3236},
--		{1628, 3263},
--		{1612, 3245},
--		{1539, 3248},
--	},	
--
--	-- 凤翔
--	[1]={
--		{1651, 3279},
--		{1520, 3228},
--		{1557, 3108},
--		{1647, 3167},
--		{1559, 3206},
--		{1603, 3191},
--		{1614, 3151},
--	},	
--
--	-- 扬州
--	[80]={
--		{1718, 3201},
--		{1593, 3197},
--		{1669, 2990},
--		{1824, 3064},
--		{1691, 3169},
--		{1702, 3022},
--		{1743, 2995},
--	},	
--	
--	-- 南岳镇
--	[54]={
--		{1590, 3092},
--		{1639, 3142},
--		{1648, 3108},
--	},
--		
--	-- 龙泉村
--	[174]={
--		{1635, 3198},
--		{1594, 3228},
--		{1572, 3254},
--		{1631, 3216},
--	},
--	
--	-- 江津村
--	[20]={
--		{3459, 6113},
--		{3468, 6163},
--		{3370, 6255},
--		{3552, 6192},
--	},
--
--	-- 龙门镇
--	[121]={
--		{1925, 4427},
--		{1980, 4595},
--		{1914, 4524},
--		{1934, 4551},
--		{1957, 4518},
--	},
--
--	-- 石鼓镇
--	[153]={
--		{1631, 3179},
--		{1684, 3244},
--		{1600, 3209},
--		{1634, 3223},
--		{1606, 3228},
--	},
--	
--	-- 稻香村
--	[101]={
--		{1622, 3099},
--		{1679, 3196},
--		{1639, 3144},
--		{1671, 3173},
--	},
--	
--	-- 永乐镇
--	[99]={
--		{1608, 3163},
--		{1630, 3305},
--		{1595, 3227},
--		{1606, 3282},
--		{1614, 3177},
--	},
--	
--	-- 朱仙镇
--	[100]={
--		{1603, 3170},
--		{1611, 3099},
--		{1679, 3102},
--		{1720, 3217},
--		{1641, 3126},
--		{1657, 3124},
--		{1621, 3181},
--	},
--	
--	-- 巴陵县
--	[53]={
--		{1579, 3236},
--		{1598, 3209},
--		{1600, 3170},
--		{1629, 3195},
--	},
}


-- 检测玩家是否在限制区域内
function offlineCheckPermitRegion()
	local nMapId, nX, nY = GetWorldPos();
	local nLimitX, nLimitY = 0,0;
	local szDirection, nDistance = "", 0;
	local i=0;
	if aryLimitRegion[nMapId] then
		for i=1, getn(aryLimitRegion[nMapId]) do
			nLimitX = aryLimitRegion[nMapId][i][1];
			nLimitY = aryLimitRegion[nMapId][i][2];
			szDirection, nDistance = getDirection({nX, nY}, {nLimitX, nLimitY});
			-- 如果距离任何一点小于 10，则说明在禁止区域内
			if nDistance<=NUM_OFFLINE_PERMITREGION_MAX then
				return 0;
			end;
		end;
		return 1;
	else
		return 1;
	end;
end;


function StallCheckPermitRegion()
	if offlineCheckPermitRegion() == 1 then
		return 1
	else
		Talk(1, "", "Không thể bày bán tại khu vực này")
	end
end

-- 获得一个位置相对于玩家位置的大体方位
function getDirection(posOrigin, posTarget)
	
	local tbStr = {"Tây Nam", "Nam", "Đông Nam", "Đông", "Đông Bắc", "bắc ", "Tây Bắc", "Tây"};
	
	local nX	= posOrigin[2] - posTarget[2];
	local nY	= posTarget[1] - posOrigin[1];
	
	local nDeg	= atan2(posOrigin[2] - posTarget[2], posTarget[1] - posOrigin[1]);
	local nDirection = floor(nDeg/45+4.5);
	
	if (nDirection == 0) then
		nDirection = 8;
	end;
	
	-- 具体的距离，取整数
	local nDistance = floor(sqrt(nX*nX + nY*nY));
	
	return tbStr[nDirection], nDistance;
	
end;
