--Author: Fong KiÒu
--Function: Thæ §Þa phï
--Date: 21/07/2021


Include("\\script\\lib\\lib_ham.lua")
Include("\\script\\lib\\lib_vatpham.lua")
Include("\\script\\lib\\lib_task.lua")

tbAllow = {
	[0]=0,[1]=2,[2]=3,[3]=4,[4]=6,[5]=7,[6]=8,[7]=9,
	[8]=11,[9]=12,[10]=13,[11]=14,[12]=16,[13]=17,[14]=18,[15]=19,
	[16]=21,[17]=22,[18]=23,[19]=24,[20]=26,[21]=27,[22]=28,[23]=29,
	[24]=31,[25]=32,[26]=33,[27]=34,[28]=35,[29]=36,[30]=37,
	[31]=39,[32]=40,[33]=41,[34]=42,[35]=43,[36]=44,
	[37]=46,[38]=47,[39]=48,[40]=49,[41]=51,[42]=52,[43]=53,[44]=54,
	[45]=55,[46]=56,[47]=57,[48]=58,[49]=59,[50]=61,[51]=62,[52]=63,[53]=64,
	[54]=66,[55]=67,[56]=68,[57]=69,[58]=71,[59]=72,[60]=73,[61]=74,
	[62]=76,[63]=77,[64]=78,[65]=79,[66]=81,[67]=82,[68]=83,[69]=84,
	[70]=85,[71]=86,[72]=87,[73]=88,[74]=89,[75]=90,[76]=91,[77]=92,
	[78]=94,[79]=96,[80]=97,[81]=98,[82]=99,[83]=101,[84]=102,[85]=103,[86]=104,
	[87]=105,[88]=106,[89]=107,[90]=108,[91]=109,[92]=111,[93]=112,[94]=113,[95]=114,
	[96]=116,[97]=117,[98]=118,[99]=119,[100]=121,[101]=122,[102]=123,[103]=124,
	[104]=126,[105]=127,[106]=128,[107]=129,[108]=131,[109]=132,[110]=133,[111]=134,
	[112]=135,[113]=136,[114]=137,[115]=138,[116]=139
}




function main(nIndex)
		dofile("script/item/ib/ruonghkmp.lua")
	if CalcFreeItemCellCount() < 10 then
		Talk(1,"","Kho¶ng trèng hµnh trang kh«ng ®ñ 10 « . §Ò nghÞ dän dÑp hµnh trang tr­íc!")
		return
	end	
	local nRand = random(117)
	local nItemId = tbAllow[nRand]
	local nIndexX = AddItem2(2, 0, nItemId, 0, 0, 0)

		
			SetPlayerItemLock(nIndexX, -2)
		local s_name = GetItemName(nIndexX)
		Msg2SubWorld("<color=yellow>Chóc mõng<color><color=green> " .. GetName() .. " <color><color=yellow>®· më r­êng hoµng kim m«n ph¸i, nhËn ®­îc <color> "..s_name.." .")
		RemoveItem(nIndex)
end